[Timeout] BooleanLiteral
src/database/models/Note.ts:35:22
   {
     id: {
       type: DataTypes.INTEGER,
-      autoIncrement: true,
+      autoIncrement: false,
       primaryKey: true,
     },

[Killed] StringLiteral
src/database/models/Note.ts:53:16
       type: DataTypes.INTEGER,
       allowNull: false,
       references: {
-        model: 'students',
+        model: "",
         key: 'id',
       },
killedBy: Note API – E2E tests POST /notes - should create a note
statusReason: TypeError: Dependency name must be given as a not empty string

[Survived] StringLiteral
src/database/models/Note.ts:54:14
       allowNull: false,
       references: {
         model: 'students',
-        key: 'id',
+        key: "",
       },
       onDelete: 'CASCADE',

[Survived] StringLiteral
src/database/models/Note.ts:56:17
         model: 'students',
         key: 'id',
       },
-      onDelete: 'CASCADE',
+      onDelete: "",
     },
   },

[Killed] StringLiteral
src/database/models/Note.ts:66:37
 );
 
 // 🔗 Звʼязки
-Student.hasMany(Note, { foreignKey: 'studentId' });
+Student.hasMany(Note, { foreignKey: "" });
 Note.belongsTo(Student, { foreignKey: 'studentId' });
 
killedBy: Note API – E2E tests POST /notes - should create a note
statusReason: Error:

[Killed] ObjectLiteral
src/database/models/Note.ts:67:25
 
 // 🔗 Звʼязки
 Student.hasMany(Note, { foreignKey: 'studentId' });
-Note.belongsTo(Student, { foreignKey: 'studentId' });
+Note.belongsTo(Student, {});
 
 export default Note;
killedBy: Note API – E2E tests POST /notes - should create a note
statusReason: Error:
