[Killed] BlockStatement
src/app.ts:12:48
 app.use('/notes', noteRoutes);
 
 // тестовий маршрут
-app.get('/', (_req: Request, res: Response) => {
-  res.send('Student Notes Manager API works!');
-});
+app.get('/', (_req: Request, res: Response) => {});
 
 export default app;
killedBy: Note API – E2E tests POST /notes - should create a note
statusReason: Error:

[Timeout] StringLiteral
src/app.ts:12:9
 app.use('/notes', noteRoutes);
 
 // тестовий маршрут
-app.get('/', (_req: Request, res: Response) => {
+app.get("", (_req: Request, res: Response) => {
   res.send('Student Notes Manager API works!');
 });

[Timeout] StringLiteral
src/app.ts:13:12
 
 // тестовий маршрут
 app.get('/', (_req: Request, res: Response) => {
-  res.send('Student Notes Manager API works!');
+  res.send("");
 });
 
