[Survived] BlockStatement
src/server.ts:6:14
 
 const PORT = 3000;
 
-(async () => {
-  try {
-    // Перевірка підключення до БД
-    await sequelize.authenticate();
-    console.log('Database connected');
-
-    // Створення таблиць і файлу database.sqlite
-    await sequelize.sync();
-    console.log('Database synchronized');
-
-    // Запуск сервера
-    app.listen(PORT, () => {
-      console.log(`Server started on port ${PORT}`);
-    });
-  } catch (error) {
-    console.error('Database error:', error);
-  }
-})();
+(async () => {})();
 
 

[Survived] BlockStatement
src/server.ts:7:7
 const PORT = 3000;
 
 (async () => {
-  try {
-    // Перевірка підключення до БД
-    await sequelize.authenticate();
-    console.log('Database connected');
-
-    // Створення таблиць і файлу database.sqlite
-    await sequelize.sync();
-    console.log('Database synchronized');
-
-    // Запуск сервера
-    app.listen(PORT, () => {
-      console.log(`Server started on port ${PORT}`);
-    });
-  } catch (error) {
+  try {} catch (error) {
     console.error('Database error:', error);
   }

[Survived] StringLiteral
src/server.ts:14:17
 
     // Створення таблиць і файлу database.sqlite
     await sequelize.sync();
-    console.log('Database synchronized');
+    console.log("");
 
     // Запуск сервера

[Survived] BlockStatement
src/server.ts:17:28
     console.log('Database synchronized');
 
     // Запуск сервера
-    app.listen(PORT, () => {
-      console.log(`Server started on port ${PORT}`);
-    });
+    app.listen(PORT, () => {});
   } catch (error) {
     console.error('Database error:', error);

[Survived] BlockStatement
src/server.ts:20:19
     app.listen(PORT, () => {
       console.log(`Server started on port ${PORT}`);
     });
-  } catch (error) {
-    console.error('Database error:', error);
-  }
+  } catch (error) {}
 })();
 

[Survived] StringLiteral
src/server.ts:21:19
       console.log(`Server started on port ${PORT}`);
     });
   } catch (error) {
-    console.error('Database error:', error);
+    console.error("", error);
   }
 })();
