[Survived] BlockStatement
src/services/note.service.ts:4:19
 import Note from '../database/models/Note';
 
 export class NoteService {
-  static getAll() {
-    return Note.findAll();
-  }
+  static getAll() {}
 
   static create(title: string, content: string) {

[Survived] BlockStatement
src/services/note.service.ts:8:49
     return Note.findAll();
   }
 
-  static create(title: string, content: string) {
-    return Note.create({ title, content });
-  }
+  static create(title: string, content: string) {}
 
   static deleteById(id: number) {

[Survived] BlockStatement
src/services/note.service.ts:12:33
     return Note.create({ title, content });
   }
 
-  static deleteById(id: number) {
-    return Note.destroy({ where: { id } });
-  }
+  static deleteById(id: number) {}
 }
 

[Survived] ObjectLiteral
src/services/note.service.ts:13:25
   }
 
   static deleteById(id: number) {
-    return Note.destroy({ where: { id } });
+    return Note.destroy({});
   }
 }
