[Killed] BlockStatement
src/routes/notes.routes.ts:7:57
 const router = Router();
 
 // POST /notes
-router.post('/', async (req: Request, res: Response) => {
-  try {
-    const note = await Note.create(req.body);
-    res.status(201).json(note);
-  } catch (error) {
-    res.status(400).json({ error: 'Cannot create note' });
-  }
-});
+router.post('/', async (req: Request, res: Response) => {});
 
 // GET /notes
killedBy: Note API – E2E tests POST /notes - should create a note
statusReason: Error:

[Timeout] BlockStatement
src/routes/notes.routes.ts:8:7
 
 // POST /notes
 router.post('/', async (req: Request, res: Response) => {
-  try {
-    const note = await Note.create(req.body);
-    res.status(201).json(note);
-  } catch (error) {
+  try {} catch (error) {
     res.status(400).json({ error: 'Cannot create note' });
   }

[Survived] BlockStatement
src/routes/notes.routes.ts:11:19
   try {
     const note = await Note.create(req.body);
     res.status(201).json(note);
-  } catch (error) {
-    res.status(400).json({ error: 'Cannot create note' });
-  }
+  } catch (error) {}
 });
 

[Timeout] BlockStatement
src/routes/notes.routes.ts:17:57
 });
 
 // GET /notes
-router.get('/', async (_req: Request, res: Response) => {
-  const notes = await Note.findAll();
-  res.status(200).json(notes);
-});
+router.get('/', async (_req: Request, res: Response) => {});
 
 export default router;
